{
    "version": "https://jsonfeed.org/version/1",
    "title": "petercoyne.github.io",
    "description": "",
    "home_page_url": "https://petercoyne.github.io",
    "feed_url": "https://petercoyne.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "Peter Coyne"
    },
    "items": [
        {
            "id": "https://petercoyne.github.io/useful-tools-1-notion.html",
            "url": "https://petercoyne.github.io/useful-tools-1-notion.html",
            "title": "Useful Tools 1 - Notion",
            "summary": "Notion is an \"All-in-one workspace\". It combines functions of a Wiki, a project/task manager, database and a note taking app. The personal pro plan is free for educational use, so I recently decided to evaluate it as a system for managing my college projects. Unlike&hellip;",
            "content_html": "<p>Notion is an \"All-in-one workspace\". It combines functions of a Wiki, a project/task manager, database and a note taking app. The personal pro plan is free for educational use, so I recently decided to evaluate it as a system for managing my college projects.</p>\n<figure class=\"post__image post__image--full\" ><img loading=\"lazy\" src=\"https://petercoyne.github.io/media/posts/2/Screenshot-2020-12-01-at-15.17.48.png\" alt=\"Notion, timeline view\" width=\"1461\" height=\"842\">\n<figcaption >Notion, Timeline view</figcaption>\n</figure>\n<p> </p>\n<p>Unlike many other pieces of project management software, a Notion workspace can be tailored to suit the needs of each project. The software provides a few fundamental building components: <strong>Pages,</strong> <strong>Blocks </strong>and<strong> Views.</strong></p>\n<h2>Pages</h2>\n<p>Pages in Notion are the primary means of structuring your system. Pages can be created as top-level items, or can be nested inside one another. Pages can contain a title, icon and cover image.</p>\n<p>The New Page screen contains several notable options. The user can either start from scratch by adding content, or choose a template from a large selection available within the app. Advanced users may choose to create their own templates for sharing with others.</p>\n<p>Below the templates there are options for making a <strong>Database</strong> type page. These are akin to a simplified version of Microsoft Excel sheets. </p>\n<p>Database columns can contain a number of field types including text, select, multi-select, person, date, files/media. There are also some advanced column types including formulae and relations. Relations allows you to map data from one database into another, as seen in the Task/Module relation in the first screenshot above. This allows me to view e.g. all tasks assigned to a particular model.</p>\n<h2>Blocks</h2>\n<p>All types of pages act as a container for Blocks, which are where you put the actual content you need. There are currently dozens of block types available, with more being added all the time. Block types can be selected by text command, for example /h2 will insert a Heading 2 block, /map will embed a google map. /mention allows you to mention another user if using it in collaboration with others. These are shortcuts for advanced users, as there is a GUI available to help you choose what kind of block you need.</p>\n<p>Overall I've found the block system to suit my personal workflow. It's very customisable, and offers features beyond the capabilities of markdown-based note taking applications.</p>\n<h2>Views</h2>\n<figure class=\"post__image post__image--right\"><img loading=\"lazy\"  src=\"https://petercoyne.github.io/media/posts/2/Screenshot-2020-12-01-at-15.40.08.png\" alt=\"Database Views\" width=\"150\" height=\"252\"></figure>\n<p>Data within a database can be visualised in a number of ways, as shown to the right of this paragraph. The screenshot at the top of the page is using the new \"Timeline\" view type.</p>\n<p>Other view types are suitable for different ways of working. Each database-type page can be assigned multiple different views, and each view can be named and customised. This allows me to quickly switch between board view (below) to track the progress of my projects, and timeline view where I can look at deadlines and see what I need to work on at any given time.</p>\n<figure class=\"post__image post__image--wide\" ><img loading=\"lazy\" src=\"https://petercoyne.github.io/media/posts/2/Screenshot-2020-12-01-at-16.04.48-2.png\" alt=\"Board View\" width=\"1597\" height=\"831\">\n<figcaption >Board VIew</figcaption>\n</figure>\n<h2>Conclusion</h2>\n<p>While I'm still new to Notion, it feels like a very promising tool. I've barely touched on the features in this post, features like collaboration and the many different ways of structuring your content. Admittedly there is an initial learning curve to the system, but it has been a rewarding experience so far.</p>\n<p> </p>\n<p> </p>",
            "author": {
                "name": "Peter Coyne"
            },
            "tags": [
            ],
            "date_published": "2020-12-01T16:12:31+00:00",
            "date_modified": "2020-12-01T16:12:31+00:00"
        },
        {
            "id": "https://petercoyne.github.io/test-post.html",
            "url": "https://petercoyne.github.io/test-post.html",
            "title": "Test Post",
            "summary": "This is a test post written in Publii.",
            "content_html": "<p>This is a test post written in Publii.</p>",
            "author": {
                "name": "Peter Coyne"
            },
            "tags": [
            ],
            "date_published": "2020-12-01T14:53:23+00:00",
            "date_modified": "2020-12-01T14:53:23+00:00"
        }
    ]
}
